; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image4 - mode
	thermograph2 - mode
	infrared1 - mode
	spectrograph0 - mode
	thermograph5 - mode
	spectrograph3 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star4 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	Star6 - direction
	Star8 - direction
	Star7 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
	Planet13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 spectrograph3)
	(supports instrument1 thermograph5)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph2)
	(supports instrument1 image4)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
)
(:goal (and
	(have_image Planet9 image4)
	(have_image Phenomenon10 image4)
	(have_image Star11 spectrograph3)
	(have_image Star11 infrared1)
	(have_image Star12 spectrograph3)
	(have_image Planet13 thermograph2)
	(have_image Planet13 spectrograph0)
	(have_image Phenomenon14 spectrograph0)
	(have_image Phenomenon14 thermograph2)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 9
2. (calibrate satellite0 instrument1 star7)
   added: (calibrated instrument1)
   goals met: 0 of 9
3. (turn_to satellite0 star12 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star12)
   goals met: 0 of 9
4. (take_image satellite0 star12 instrument1 spectrograph3)
   added: (have_image star12 spectrograph3)
   goals met: 1 of 9
5. (turn_to satellite0 planet9 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 planet9)
   goals met: 1 of 9
6. (take_image satellite0 planet9 instrument1 image4)
   added: (have_image planet9 image4)
   goals met: 2 of 9
7. (turn_to satellite0 phenomenon10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 9
8. (take_image satellite0 phenomenon10 instrument1 image4)
   added: (have_image phenomenon10 image4)
   goals met: 3 of 9
9. (turn_to satellite0 phenomenon14 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon14)
   goals met: 3 of 9
10. (take_image satellite0 phenomenon14 instrument1 spectrograph0)
   added: (have_image phenomenon14 spectrograph0)
   goals met: 4 of 9
11. (take_image satellite0 phenomenon14 instrument1 thermograph2)
   added: (have_image phenomenon14 thermograph2)
   goals met: 5 of 9
12. (turn_to satellite0 planet13 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet13)
   goals met: 5 of 9
13. (take_image satellite0 planet13 instrument1 spectrograph0)
   added: (have_image planet13 spectrograph0)
   goals met: 6 of 9
14. (take_image satellite0 planet13 instrument1 thermograph2)
   added: (have_image planet13 thermograph2)
   goals met: 7 of 9
15. (turn_to satellite0 star11 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star11)
   goals met: 7 of 9
16. (take_image satellite0 star11 instrument1 infrared1)
   added: (have_image star11 infrared1)
   goals met: 8 of 9
17. (take_image satellite0 star11 instrument1 spectrograph3)
   added: (have_image star11 spectrograph3)
   goals met: 9 of 9
